# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 13  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

## YOLOv8.0n backbone
# 第一次
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
#  - [-1, 1, ConvDu, [16, 3, 1]]  # 1
#  - [-1, 1, ConvDu, [24, 3, 2]]  # 2-p2
#  - [-1, 1, ConvDu, [24, 3, 1]]  # 3
#  - [-1, 1, ConvDu, [24, 3, 1]]  # 4
#  - [-1, 1, ConvDu, [48, 3, 2]]  # 5-P3
#  - [-1, 1, MultiScaleAttentionBlock, [48]] # out 6
#  - [-1, 1, ConvDu, [64, 3, 2]]  # 7-P4
#  - [-1, 1, MultiScaleAttentionBlock, [64]] # out 8
#  - [-1, 1, ConvDu, [80, 3, 2]]  # 9-p5
#  - [-1, 1, MultiScaleAttentionBlock, [80]] # out 10

# 第二次
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
#  - [-1, 1, MV2Block, [16, 1, 2]]  # 1
#  - [-1, 1, MV2Block, [24, 2, 2]]  # 2-p2
#  - [-1, 1, MV2Block, [24, 1, 2]]  # 3
#  - [-1, 1, MV2Block, [24, 1, 2]]  # 4
#  - [-1, 1, MV2Block, [48, 2, 2]]  # 5-P3
#  - [-1, 1, MobileViTBlock, [64, 2, 3, 2, 128, 0]] # out 6
#  - [-1, 1, MV2Block, [64, 2, 2]]  # 7-P4
#  - [-1, 1, MobileViTBlock, [80, 4, 3 ,2, 160, 0]] # out 8
#  - [-1, 1, MV2Block, [80, 2, 2]]  # 9-p5
#  - [-1, 1, MobileViTBlock, [96, 3, 3, 1, 192, 0]] # out 10

# 第三次  
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
#  - [-1, 1, MV2Block, [16, 1, 2]]  # 1
#  - [-1, 1, MV2Block, [24, 2, 2]]  # 2-p2
#  - [-1, 1, MV2Block, [24, 1, 2]]  # 3
#  - [-1, 1, MV2Block, [24, 1, 2]]  # 4
#  - [-1, 1, MV2Block, [48, 2, 2]]  # 5-P3
#  - [-1, 1, MultiScaleAttentionBlock, [48]] # out 6
#  - [-1, 1, MV2Block, [64, 2, 2]]  # 7-P4
#  - [-1, 1, MultiScaleAttentionBlock, [64]] # out 8
#  - [-1, 1, MV2Block, [80, 2, 2]]  # 9-p5
#  - [-1, 1, MultiScaleAttentionBlock, [80]] # out 10


# # 第四次
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
#   - [-1, 1, ConvDu, [16, 3, 1]]  # 1
#   - [-1, 1, ConvDu, [24, 3, 2]]  # 2-p2
#   - [-1, 1, ConvDu, [24, 3, 1]]  # 3
#   - [-1, 1, ConvDu, [24, 3, 1]]  # 4
#   - [-1, 1, MV2Block, [48, 2, 2]]  # 5-P3
#   - [-1, 1, MobileViTBlock, [64, 2, 3, 2, 128, 0]] # out 6
#   - [-1, 1, MV2Block, [64, 2, 2]]  # 7-P4
#   - [-1, 1, MobileViTBlock, [80, 4, 3 ,2, 160, 0]] # out 8
#   - [-1, 1, MV2Block, [80, 2, 2]]  # 9-p5
#   - [-1, 1, MobileViTBlock, [96, 3, 3, 1, 192, 0]] # out 10

## 第5次
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
#  - [-1, 1, ConvDu, [16, 3, 1]]  # 1
#  - [-1, 1, ConvDu, [24, 3, 2]]  # 2-p2
#  - [-1, 1, ConvDu, [24, 3, 1]]  # 3
#  - [-1, 1, ConvDu, [24, 3, 1]]  # 4
#  - [-1, 1, ConvDu, [48, 3, 2]]  # 5-P3
#  - [-1, 1, MobileViTBlock, [64, 2, 3, 2, 128, 0]] # out 6
#  - [-1, 1, ConvDu, [64, 3, 2]]  # 7-P4
#  - [-1, 1, MobileViTBlock, [80, 4, 3 ,2, 160, 0]] # out 8
#  - [-1, 1, ConvDu, [80, 3, 2]]  # 9-p5
#  - [-1, 1, MobileViTBlock, [96, 3, 3, 1, 192, 0]] # out 10

## 第6次
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
#  - [-1, 1, ConvDu, [16, 3, 1]]  # 1
#  - [-1, 1, ConvDu, [24, 3, 2]]  # 2-p2
#  - [-1, 1, ConvDu, [24, 3, 1]]  # 3
#  - [-1, 1, ConvDu, [24, 3, 1]]  # 4
#  - [-1, 1, ConvDu, [48, 3, 2]]  # 5-P3
#  - [-1, 1, CustomConvAttentionBlock, [48]] # out 6
#  - [-1, 1, ConvDu, [64, 3, 2]]  # 7-P4
#  - [-1, 1, CustomConvAttentionBlock, [64]] # out 8
#  - [-1, 1, ConvDu, [80, 3, 2]]  # 9-p5
#  - [-1, 1, CustomConvAttentionBlock, [80]] # out 10

# 第7次
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
  - [-1, 1, ConvDu, [16, 3, 1]]  # 1
  - [-1, 1, ConvDu, [24, 3, 2]]  # 2-p2
  - [-1, 1, ConvDu, [24, 3, 1]]  # 3
  - [-1, 1, ConvDu, [24, 3, 1]]  # 4
  - [-1, 1, ConvDu, [48, 3, 2]]  # 5-P3
  - [-1, 1, CustomConvAttentionBlock, [48]] # out 6
  - [-1, 1, ConvDu, [64, 3, 2]]  # 7-P4
  - [-1, 1, CustomConvAttentionBlock, [64]] # out 8
  - [-1, 1, ConvDu, [80, 3, 2]]  # 9-p5
  - [-1, 1, CustomConvAttentionBlock, [80]] # out 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, C2f, [72]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, C2f, [36]]  # 16 (P3/8-small)

  - [-1, 1, Conv, [36, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 1, C2f, [72]]  # 19 (P4/16-medium)

  - [-1, 1, Conv, [72, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 1, C2f, [144]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)
